IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DMASS0_BCDMA_0_BCDMA_CRED.xml
<module name="DMASS0_BCDMA_0_BCDMA_CRED" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="BCDMA_CRED_CRED" acronym="BCDMA_CRED_CRED" offset="0x0" width="32" description="The Credentials Register provides credentials to be used when performing memory accesses using this flow.">
		<bitfield id="SECURE" width="1" begin="26" end="26" resetval="0x0" description="Secure attribute" range="26" rwaccess="R/W"/> 
		<bitfield id="PRIV" width="2" begin="25" end="24" resetval="0x0" description="Privelege attribute" range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PRIVID" width="8" begin="23" end="16" resetval="0x0" description="Privelege ID attribute" range="23 - 16" rwaccess="R/W"/>
	</register>
</module>